In [3]:
import pandas as pd
from pathlib import Path

DATA = Path("../data/customers.csv")

df = pd.read_csv(DATA)
df.head()

   customer_id name  age     city  spent_usd   joined_at
0          101  Ana   28   Warsaw     120.50  2024-03-15
1          102  Ben   41   Krakow      89.90  2023-11-02
2          103  Cam   33   Gdansk        NaN  2024-01-08
3          104  Dor   28   Warsaw     220.00  2023-12-21
4          105  Eli   52  Wroclaw     310.75  2022-07-30

In [5]:
df.tail(3)

   customer_id name  age     city  spent_usd   joined_at
2          103  Cam   33   Gdansk        NaN  2024-01-08
3          104  Dor   28   Warsaw     220.00  2023-12-21
4          105  Eli   52  Wroclaw     310.75  2022-07-30

In [6]:
df.shape

(5, 6)

In [7]:
df.columns

Index(['customer_id', 'name', 'age', 'city', 'spent_usd', 'joined_at'], dtype='object')

In [8]:
df.dtypes

customer_id      int64
name            object
age              int64
city            object
spent_usd      float64
joined_at       object
dtype: object

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   customer_id  5 non-null      int64
 1   name         5 non-null      object
 2   age          5 non-null      int64
 3   city         5 non-null      object
 4   spent_usd    4 non-null      float64
 5   joined_at    5 non-null      object
dtypes: float64(1), int64(2), object(3)
memory usage: 372.0+ bytes

In [11]:
df["city"].value_counts()
df["age"].min(), df["age"].max(), df["age"].mean()
df["spent_usd"].isna().sum()

np.int64(1)

In [12]:
df["city"].value_counts()
df["age"].min(), df["age"].max(), df["age"].mean()
df["spent_usd"].isna().sum()

np.int64(1)

In [13]:
import sys, pandas as pd
print("pandas:", pd.__version__)
print("python:", sys.executable)

pandas: 2.3.1
python: c:\Users\dmdem\Documents\etl-streamlit\day01_intro_pandas\.venv\Scripts\python.exe

In [3]:
import pandas as pd
from pathlib import Path

# sprawdź aktualny folder roboczy (opcjonalnie)
import os; print("CWD:", os.getcwd())

# ścieżka do pliku – popraw, jeśli Twój CSV leży gdzie indziej
DATA = Path("../data/customers.csv")

df = pd.read_csv(DATA)

# upewnij się, że kolumny liczbowe są naprawdę liczbami
for col in ["age", "spent_usd"]:
    if col in df.columns:
        df[col] = pd.to_numeric(df[col], errors="coerce")

df.head()

CWD: c:\Users\dmdem\Documents\etl-streamlit\day01_intro_pandas\notebooks

   customer_id name  age     city  spent_usd   joined_at
0          101  Ana   28   Warsaw     120.50  2024-03-15
1          102  Ben   41   Krakow      89.90  2023-11-02
2          103  Cam   33   Gdansk        NaN  2024-01-08
3          104  Dor   28   Warsaw     220.00  2023-12-21
4          105  Eli   52  Wroclaw     310.75  2022-07-30

In [6]:

df.select_dtypes(include="number").describe()

       customer_id        age  spent_usd
count     5.000000   5.000000    4.00000
mean    103.000000  36.400000  185.28750
std       1.581139  10.212737  100.40251
min     101.000000  28.000000   89.90000
25%     102.000000  28.000000  112.85000
50%     103.000000  33.000000  170.25000
75%     104.000000  41.000000  242.68750
max     105.000000  52.000000  310.75000

In [8]:
df["city"].value_counts()

city
Warsaw     2
Krakow     1
Gdansk     1
Wroclaw    1
Name: count, dtype: int64

In [9]:
df["age"].min(), df["age"].max(), df["age"].mean()

(np.int64(28), np.int64(52), np.float64(36.4))

In [10]:
df["spent_usd"].isna().sum()

np.int64(1)

Selekcja, filtrowanie, indeksy

In [12]:
#Wybór kolumn i wierszy:
df["name"]

0    Ana
1    Ben
2    Cam
3    Dor
4    Eli
Name: name, dtype: object

In [13]:
df[["name","city","spent_usd"]]

  name     city  spent_usd
0  Ana   Warsaw     120.50
1  Ben   Krakow      89.90
2  Cam   Gdansk        NaN
3  Dor   Warsaw     220.00
4  Eli  Wroclaw     310.75

In [14]:
df.iloc[0:3, 0:2]       # po numerach

   customer_id name
0          101  Ana
1          102  Ben
2          103  Cam

In [15]:
df.loc[ df["city"]=="Warsaw", ["name","spent_usd"] ]

  name  spent_usd
0  Ana      120.5
3  Dor      220.0

In [17]:
#Filtrowanie (maski logiczne):
young = df[df["age"] < 35]
high_spenders = df[df["spent_usd"] > 200]
warsaw_or_krk = df[df["city"].isin(["Warsaw","Krakow"])]

young, high_spenders, warsaw_or_krk

(   customer_id name  age    city  spent_usd   joined_at
 0          101  Ana   28  Warsaw      120.5  2024-03-15
 2          103  Cam   33  Gdansk        NaN  2024-01-08
 3          104  Dor   28  Warsaw      220.0  2023-12-21,
    customer_id name  age     city  spent_usd   joined_at
 3          104  Dor   28   Warsaw     220.00  2023-12-21
 4          105  Eli   52  Wroclaw     310.75  2022-07-30,
    customer_id name  age    city  spent_usd   joined_at
 0          101  Ana   28  Warsaw      120.5  2024-03-15
 1          102  Ben   41  Krakow       89.9  2023-11-02
 3          104  Dor   28  Warsaw      220.0  2023-12-21)

In [18]:
#Warunki łączone:
cond = (df["city"]=="Warsaw") & (df["age"]<30)
df[cond]

   customer_id name  age    city  spent_usd   joined_at
0          101  Ana   28  Warsaw      120.5  2024-03-15
3          104  Dor   28  Warsaw      220.0  2023-12-21

In [24]:
#Indeksy:
df2 = df.set_index("customer_id")
df2.loc[104]           # szybki dostęp po kluczu
df2.reset_index(inplace=True)

In [28]:
#zad
df3=df[(df["city"]=="Warsaw") & (df["spent_usd"]> 100)]["name"]
df3

0    Ana
3    Dor
Name: name, dtype: object

Proste transformacje: kolumny, typy, braki, sortowanie

In [ ]:
#nowe kolumny
df["spent_pln"] = df["spent_usd"] * 4.0   # przyjmij kurs 4.0
df["name_upper"] = df["name"].str.upper()
df.head()

   customer_id name  age     city  spent_usd   joined_at  spent_pln name_upper
0          101  Ana   28   Warsaw     120.50  2024-03-15      482.0        ANA
1          102  Ben   41   Krakow      89.90  2023-11-02      359.6        BEN
2          103  Cam   33   Gdansk        NaN  2024-01-08        NaN        CAM
3          104  Dor   28   Warsaw     220.00  2023-12-21      880.0        DOR
4          105  Eli   52  Wroclaw     310.75  2022-07-30     1243.0        ELI

In [33]:
#daty i typy
df["joined_at"] = pd.to_datetime(df["joined_at"])
df["year_joined"] = df["joined_at"].dt.year
df["spent_usd"] = pd.to_numeric(df["spent_usd"], errors="coerce")
df.dtypes

customer_id             int64
name                   object
age                     int64
city                   object
spent_usd             float64
joined_at      datetime64[ns]
spent_pln             float64
name_upper             object
year_joined             int32
dtype: object

In [35]:
#braki danych 2 startegie
# strategia 1: podmień NaN średnią
df["spent_usd_filled"] = df["spent_usd"].fillna(df["spent_usd"].mean())
# strategia 2: usuń wiersze bez spent_usd
df_dropna = df.dropna(subset=["spent_usd"])

len(df), len(df_dropna)

(5, 4)

In [36]:
#sortowanie i TOP
df_sorted = df.sort_values(by=["spent_usd_filled"], ascending=False)
df_sorted.head(3)

,customer_id,name,age,city,spent_usd,joined_at,spent_pln,name_upper,year_joined,spent_usd_filled
4,105,Eli,52,Wroclaw,310.75,2022-07-30,1243.0,ELI,2022,310.7500
3,104,Dor,28,Warsaw,220.00,2023-12-21,880.0,DOR,2023,220.0000
2,103,Cam,33,Gdansk,NaN,2024-01-08,NaN,CAM,2024,185.2875

In [37]:
#zapis wyniku
# jak potraktowalam braki i dlaczego
df_sorted.to_csv("../data/customers_clean.csv", index=False)

mini raport

In [38]:
# średni wydatek per miasto
city_avg = df_dropna.groupby("city")["spent_usd"].mean().sort_values(ascending=False)
city_avg
# rozkład wieku w koszykach
df["age_bin"] = pd.cut(df["age"], bins=[0,29,39,49,120], labels=["<30","30-39","40-49","50+"])
df.groupby("age_bin")["spent_usd_filled"].mean()

C:\Users\dmdem\AppData\Local\Temp\ipykernel_11168\2257663886.py:6: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  df.groupby("age_bin")["spent_usd_filled"].mean()

age_bin
<30      170.2500
30-39    185.2875
40-49     89.9000
50+      310.7500
Name: spent_usd_filled, dtype: float64

In [39]:
city_avg.plot(kind="bar", title="Średni wydatek (USD) per miasto")

ImportError: matplotlib is required for plotting when the default backend "matplotlib" is selected.

In [40]:
#zapisz wyniki
city_avg.to_csv("../data/city_avg.csv")
df.to_csv("../data/customers_enriched.csv", index=False)

Notatka – analiza danych z `customers.csv`

Podczas wczytywania pliku `customers.csv` zauważyłam, że w kolumnach `age` oraz `spent_usd` występowały braki danych. Potraktowałam je poprzez konwersję wartości na typ liczbowy (`to_numeric`) i ustawienie błędnych lub pustych wpisów na `NaN`. Dzięki temu możliwe było ich łatwe zliczenie
zliczenie i ewentualne dalsze przetwarzanie. Wartości `NaN` zostały pozostawione w zbiorze, aby nie wprowadzać sztucznych danych i móc ocenić skalę braków. Sprawdziłam również wartości minimalne, maksymalne i średnie w kolumnach `age` oraz `spent_usd`. Braki w danych nie były na tyle duże, by uniemożliwić analizę, ale mogą wpływać na średnie i inn
inne miary. Dla dalszych analiz można rozważyć imputację wartości (np. średnią lub medianą) lub usunięcie rekordów z brakami.
Wnioski:**  
1. Dane zawierają pewne braki, głównie w kolumnach liczbowych, ale ich skala jest umiarkowana.  
2. Zachowanie `NaN` pozwala na transparentną analizę i uniknięcie wprowadzania błędnych założeń.  
3. Kolejne kroki analizy powinny uwzględniać wpływ braków na wyniki statystyczne i modele predykcyjne.